#### DocumentType Enumeration

---

|  |
| --- |
| See Also |

Types of Revit documents.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public enum DocumentType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DocumentType ``` |

| Visual C++ |
| --- |
| ``` public enum class DocumentType ``` |

# Members

| Member name | Description |
| --- | --- |
| Project | Project document. |
| Family | Family document. |
| Template | Template document. |
| IFC | IFC document. |
| BuildingComponent | Building Component document. |
| Other | Document of another type. |

# See Also

Autodesk.Revit.DB Namespace